Samsung/TizenRT/os/arch/arm/src/imxrt/chip/imxrt_usb.h
/****************************************************************************
 *
 * Copyright 2019 NXP Semiconductors All Rights Reserved.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing,
 * software distributed under the License is distributed on an
 * "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND,
 * either express or implied. See the License for the specific
 * language governing permissions and limitations under the License.
 *
 ****************************************************************************/
/************************************************************************************
 * arch/arm/src/imxrt/chip/imxrt_usb.h
 *
 *   Copyright (C) 2010, 2013 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <gnutt@nuttx.org>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ************************************************************************************/

#ifndef __ARCH_ARM_SRC_IMXRT_CHIP_IMXRT_USB_H
#define __ARCH_ARM_SRC_IMXRT_CHIP_IMXRT_USB_H

/************************************************************************************
 * Included Files
 ************************************************************************************/

#include <tinyara/config.h>
#include <tinyara/usb/ohci.h>

#include "chip.h"
#include "chip/imxrt105x_memorymap.h"

/************************************************************************************
 * Pre-processor Definitions
 ************************************************************************************/

/************************************************************************************************
 * Pre-processor Definitions
 ************************************************************************************************/
#define IMXRT_EHCI_NRHPORT                1	/* There is only a single root hub port */

/* USBOTG register base address offset into the USBOTG domain ***********************************/

#define IMXRT_USBOTG_VBASE                (IMXRT_USBOTG_VSECTION)
#define IMXRT_USBOTG_PBASE                (IMXRT_USBOTG_PSECTION)

/* Register Offsets *****************************************************************************/
/* 0x000 - 0x0ff: Reserved */
/* Device/host capability registers */

#define IMXRT_USBOTG_HCCR_OFFSET             0x0100	/* Offset to EHCI Host Controller Capability registers */
#define IMXRT_USBOTG_CAPLENGTH_OFFSET        0x0100	/* Capability length register */
#define IMXRT_USBHOST_HCSPARAMS_OFFSET       0x0104	/* Host controller structural parameters */
#define IMXRT_USBHOST_HCCPARAMS_OFFSET       0x0108	/* Host controller capability parameters */
#define IMXRT_USBDEV_DCIVERSION_OFFSET       0x0120	/* Device interface version number */
#define IMXRT_USBDEV_DCCPARAMS_OFFSET        0x0124	/* Device controller capability parameters */

/* Device/host/OTG operational registers */

#define IMXRT_USBOTG_HCOR_OFFSET             0x0140	/* Offset to EHCI Host Controller Operational Registers */
#define IMXRT_USBOTG_USBCMD_OFFSET           0x0140	/* USB command (both) */
#define IMXRT_USBOTG_USBSTS_OFFSET           0x0144	/* USB status (both) */
#define IMXRT_USBOTG_USBINTR_OFFSET          0x0148	/* USB interrupt enable (both) */
#define IMXRT_USBOTG_FRINDEX_OFFSET          0x014c	/* USB frame index (both) */
#define IMXRT_USBHOST_PERIODICLIST_OFFSET    0x0154	/* Frame list base address (host) */
#define IMXRT_USBDEV_DEVICEADDR_OFFSET       0x0154	/* USB device address (device) */
#define IMXRT_USBHOST_ASYNCLISTADDR_OFFSET   0x0158	/* Next asynchronous list address (host) */
#define IMXRT_USBDEV_ENDPOINTLIST_OFFSET     0x0158	/* Address of endpoint list in memory (device) */
#define IMXRT_USBHOST_TTCTRL_OFFSET          0x015c	/* Asynchronous buffer status for embedded TT (host) */
#define IMXRT_USBOTG_BURSTSIZE_OFFSET        0x0160	/* Programmable burst size (both) */
#define IMXRT_USBHOST_TXFILLTUNING_OFFSET    0x0164	/* Host transmit pre-buffer packet tuning (host) */
#define IMXRT_USBOTG_BINTERVAL_OFFSET        0x0174	/* Length of virtual frame (both) */
#define IMXRT_USBDEV_ENDPTNAK_OFFSET         0x0178	/* Endpoint NAK (device) */
#define IMXRT_USBDEV_ENDPTNAKEN_OFFSET       0x017c	/* Endpoint NAK Enable (device) */
#define IMXRT_USBOTG_PORTSC1_OFFSET          0x0184	/* Port status/control 1 (both) */
#define IMXRT_USBOTG_OTGSC_OFFSET            0x01a4	/* OTG status and control (otg) */
#define IMXRT_USBOTG_USBMODE_OFFSET          0x01a8	/* USB device mode (both) */

/* Device side naming of common register offsets */

#define IMXRT_USBDEV_USBCMD_OFFSET           IMXRT_USBOTG_USBCMD_OFFSET
#define IMXRT_USBDEV_USBSTS_OFFSET           IMXRT_USBOTG_USBSTS_OFFSET
#define IMXRT_USBDEV_USBINTR_OFFSET          IMXRT_USBOTG_USBINTR_OFFSET
#define IMXRT_USBDEV_FRINDEX_OFFSET          IMXRT_USBOTG_FRINDEX_OFFSET
#define IMXRT_USBDEV_BURSTSIZE_OFFSET        IMXRT_USBOTG_BURSTSIZE_OFFSET
#define IMXRT_USBDEV_BINTERVAL_OFFSET        IMXRT_USBOTG_BINTERVAL_OFFSET
#define IMXRT_USBDEV_PORTSC1_OFFSET          IMXRT_USBOTG_OTGSC_OFFSET
#define IMXRT_USBDEV_USBMODE_OFFSET          IMXRT_USBOTG_USBMODE_OFFSET

/* Host side naming of common registers */

#define IMXRT_USBHOST_USBCMD_OFFSET          IMXRT_USBOTG_USBCMD_OFFSET
#define IMXRT_USBHOST_USBSTS_OFFSET          IMXRT_USBOTG_USBSTS_OFFSET
#define IMXRT_USBHOST_USBINTR_OFFSET         IMXRT_USBOTG_USBINTR_OFFSET
#define IMXRT_USBHOST_FRINDEX_OFFSET         IMXRT_USBOTG_FRINDEX_OFFSET
#define IMXRT_USBHOST_BURSTSIZE_OFFSET       IMXRT_USBOTG_BURSTSIZE_OFFSET
#define IMXRT_USBHOST_BINTERVAL_OFFSET       IMXRT_USBOTG_BINTERVAL_OFFSET
#define IMXRT_USBHOST_PORTSC1_OFFSET         IMXRT_USBOTG_OTGSC_OFFSET
#define IMXRT_USBHOST_USBMODE_OFFSET         IMXRT_USBOTG_USBMODE_OFFSET

/* Device endpoint registers */

#define IMXRT_USBDEV_ENDPTSETUPSTAT_OFFSET   0x01ac	/* Endpoint setup status */
#define IMXRT_USBDEV_ENDPTPRIME_OFFSET       0x01b0	/* Endpoint initialization */
#define IMXRT_USBDEV_ENDPTFLUSH_OFFSET       0x01b4	/* Endpoint de-initialization */
#define IMXRT_USBDEV_ENDPTSTATUS_OFFSET      0x01b8	/* Endpoint status */
#define IMXRT_USBDEV_ENDPTCOMPLETE_OFFSET    0x01bc	/* Endpoint complete */

#define IMXRT_USBDEV_ENDPTCTRL_OFFSET(n)     (0x01c0 + ((n) << 2))
#define IMXRT_USBDEV_ENDPTCTRL0_OFFSET       0x01c0	/* Endpoint control 0 */
#define IMXRT_USBDEV_ENDPTCTRL1_OFFSET       0x01c4	/* Endpoint control 1 */
#define IMXRT_USBDEV_ENDPTCTRL2_OFFSET       0x01c8	/* Endpoint control 2 */
#define IMXRT_USBDEV_ENDPTCTRL3_OFFSET       0x01cc	/* Endpoint control 3 */
#define IMXRT_USBDEV_ENDPTCTRL4_OFFSET       0x01d0	/* Endpoint control 4 */
#define IMXRT_USBDEV_ENDPTCTRL5_OFFSET       0x01d4	/* Endpoint control 5 */
#define IMXRT_USBDEV_ENDPTCTRL6_OFFSET       0x01d4	/* Endpoint control 6 */
#define IMXRT_USBDEV_ENDPTCTRL7_OFFSET       0x01d4	/* Endpoint control 7 */

/* USB0 register (virtual) addresses **********************************************************/

/* Device/host capability registers */
#define IMXRT_USBOTG_HCCR_BASE               (IMXRT_USB_BASE+IMXRT_USBOTG_HCCR_OFFSET)
#define IMXRT_USBOTG_CAPLENGTH               (IMXRT_USB_BASE+IMXRT_USBOTG_CAPLENGTH_OFFSET)
#define IMXRT_USBHOST_HCIVERSION             (IMXRT_USB_BASE+IMXRT_USBHOST_HCIVERSION_OFFSET)
#define IMXRT_USBHOST_HCSPARAMS              (IMXRT_USB_BASE+IMXRT_USBHOST_HCSPARAMS_OFFSET)
#define IMXRT_USBHOST_HCCPARAMS              (IMXRT_USB_BASE+IMXRT_USBHOST_HCCPARAMS_OFFSET)
#define IMXRT_USBDEV_DCIVERSION              (IMXRT_USB_BASE+IMXRT_USBDEV_DCIVERSION_OFFSET)
#define IMXRT_USBDEV_DCCPARAMS               (IMXRT_USB_BASE+IMXRT_USBDEV_DCCPARAMS_OFFSET)

/* Device/host operational registers */
#define IMXRT_USBOTG_HCOR_BASE               (IMXRT_USB_BASE+IMXRT_USBOTG_HCOR_OFFSET)
#define IMXRT_USBOTG_USBCMD                  (IMXRT_USB_BASE+IMXRT_USBOTG_USBCMD_OFFSET)
#define IMXRT_USBOTG_USBSTS                  (IMXRT_USB_BASE+IMXRT_USBOTG_USBSTS_OFFSET)
#define IMXRT_USBOTG_USBINTR                 (IMXRT_USB_BASE+IMXRT_USBOTG_USBINTR_OFFSET)
#define IMXRT_USBOTG_FRINDEX                 (IMXRT_USB_BASE+IMXRT_USBOTG_FRINDEX_OFFSET)
#define IMXRT_USBHOST_PERIODICLIST           (IMXRT_USB_BASE+IMXRT_USBHOST_PERIODICLIST_OFFSET)
#define IMXRT_USBDEV_DEVICEADDR              (IMXRT_USB_BASE+IMXRT_USBDEV_DEVICEADDR_OFFSET)
#define IMXRT_USBHOST_ASYNCLISTADDR          (IMXRT_USB_BASE+IMXRT_USBHOST_ASYNCLISTADDR_OFFSET)
#define IMXRT_USBDEV_ENDPOINTLIST            (IMXRT_USB_BASE+IMXRT_USBDEV_ENDPOINTLIST_OFFSET)
#define IMXRT_USBHOST_TTCTRL                 (IMXRT_USB_BASE+IMXRT_USBHOST_TTCTRL_OFFSET)
#define IMXRT_USBOTG_BURSTSIZE               (IMXRT_USB_BASE+IMXRT_USBOTG_BURSTSIZE_OFFSET)
#define IMXRT_USBHOST_TXFILLTUNING           (IMXRT_USB_BASE+IMXRT_USBHOST_TXFILLTUNING_OFFSET)
#define IMXRT_USBOTG_BINTERVAL               (IMXRT_USB_BASE+IMXRT_USBOTG_BINTERVAL_OFFSET)
#define IMXRT_USBDEV_ENDPTNAK                (IMXRT_USB_BASE+IMXRT_USBDEV_ENDPTNAK_OFFSET)
#define IMXRT_USBDEV_ENDPTNAKEN              (IMXRT_USB_BASE+IMXRT_USBDEV_ENDPTNAKEN_OFFSET)
#define IMXRT_USBOTG_PORTSC1                 (IMXRT_USB_BASE+IMXRT_USBOTG_PORTSC1_OFFSET)
#define IMXRT_USBOTG_OTGSC                   (IMXRT_USB_BASE+IMXRT_USBOTG_OTGSC_OFFSET)
#define IMXRT_USBOTG_USBMODE                 (IMXRT_USB_BASE+IMXRT_USBOTG_USBMODE_OFFSET)

/* Device side naming of common register offsets */

#define IMXRT_USBDEV_USBCMD                  IMXRT_USBOTG_USBCMD
#define IMXRT_USBDEV_USBSTS                  IMXRT_USBOTG_USBSTS
#define IMXRT_USBDEV_USBINTR                 IMXRT_USBOTG_USBINTR
#define IMXRT_USBDEV_FRINDEX                 IMXRT_USBOTG_FRINDEX
#define IMXRT_USBDEV_BURSTSIZE               IMXRT_USBOTG_BURSTSIZE
#define IMXRT_USBDEV_BINTERVAL               IMXRT_USBOTG_BINTERVAL
#define IMXRT_USBDEV_PORTSC1                 IMXRT_USBOTG_OTGSC
#define IMXRT_USBDEV_USBMODE                 IMXRT_USBOTG_USBMODE

/* Host side naming of common registers */

