Samsung/TizenRT/os/arch/arm/src/imxrt/chip/imxrt_usb.h
#define IMXRT_USBHOST_USBCMD                 IMXRT_USBOTG_USBCMD
#define IMXRT_USBHOST_USBSTS                 IMXRT_USBOTG_USBSTS
#define IMXRT_USBHOST_USBINTR                IMXRT_USBOTG_USBINTR
#define IMXRT_USBHOST_FRINDEX                IMXRT_USBOTG_FRINDEX
#define IMXRT_USBHOST_BURSTSIZE              IMXRT_USBOTG_BURSTSIZE
#define IMXRT_USBHOST_BINTERVAL              IMXRT_USBOTG_BINTERVAL
#define IMXRT_USBHOST_PORTSC1                IMXRT_USBOTG_OTGSC
#define IMXRT_USBHOST_USBMODE                IMXRT_USBOTG_USBMODE

/* Device endpoint registers */

#define IMXRT_USBDEV_ENDPTSETUPSTAT          (IMXRT_USB_BASE+IMXRT_USBDEV_ENDPTSETUPSTAT_OFFSET)
#define IMXRT_USBDEV_ENDPTPRIME              (IMXRT_USB_BASE+IMXRT_USBDEV_ENDPTPRIME_OFFSET)
#define IMXRT_USBDEV_ENDPTFLUSH              (IMXRT_USB_BASE+IMXRT_USBDEV_ENDPTFLUSH_OFFSET)
#define IMXRT_USBDEV_ENDPTSTATUS             (IMXRT_USB_BASE+IMXRT_USBDEV_ENDPTSTATUS_OFFSET)
#define IMXRT_USBDEV_ENDPTCOMPLETE           (IMXRT_USB_BASE+IMXRT_USBDEV_ENDPTCOMPLETE_OFFSET)

#define IMXRT_USBDEV_ENDPTCTRL(n)            (IMXRT_USB_BASE+IMXRT_USBDEV_ENDPTCTRL_OFFSET(n))
#define IMXRT_USBDEV_ENDPTCTRL0              (IMXRT_USB_BASE+IMXRT_USBDEV_ENDPTCTRL0_OFFSET)
#define IMXRT_USBDEV_ENDPTCTRL1              (IMXRT_USB_BASE+IMXRT_USBDEV_ENDPTCTRL1_OFFSET)
#define IMXRT_USBDEV_ENDPTCTRL2              (IMXRT_USB_BASE+IMXRT_USBDEV_ENDPTCTRL2_OFFSET)
#define IMXRT_USBDEV_ENDPTCTRL3              (IMXRT_USB_BASE+IMXRT_USBDEV_ENDPTCTRL3_OFFSET)
#define IMXRT_USBDEV_ENDPTCTRL4              (IMXRT_USB_BASE+IMXRT_USBDEV_ENDPTCTRL4_OFFSET)
#define IMXRT_USBDEV_ENDPTCTRL5              (IMXRT_USB_BASE+IMXRT_USBDEV_ENDPTCTRL5_OFFSET)

/* USB0 register bit definitions **************************************************************/

/* Device/host capability registers */
/* Capability length register */

#define USBOTG_CAPLENGTH_SHIFT               (0)	/* Bits 0-7: Offset from register base to operational regs */
#define USBOTG_CAPLENGTH_MASK                (0xff << USBOTG_CAPLENGTH_SHIFT)
#define USBHOST_HCIVERSION_SHIFT             (8)	/* Bits 8-23: BCD encoding of the EHCI revision number */
#define USBHOST_HCIVERSION_MASK              (0xffff << USBHOST_HCIVERSION_SHIFT)
/* Bits 24-31: Reserved */
/* Host controller structural parameters */

#define USBHOST_HCSPARAMS_NPORTS_SHIFT       (0)	/* Bits 0-3: Number of downstream ports */
#define USBHOST_HCSPARAMS_NPORTS_MASK        (15 << USBHOST_HCSPARAMS_NPORTS_SHIFT)
#define USBHOST_HCSPARAMS_PPC                (1 >> 4)	/* Bit 4:  Port Power Control */
/* Bits 5-7: Reserved */
#define USBHOST_HCSPARAMS_NPCC_SHIFT         (8)	/* Bits 8-11: Number of Ports per Companion Controller */
#define USBHOST_HCSPARAMS_NPCC_MASK          (15 << USBHOST_HCSPARAMS_NPCC_SHIFT)
#define USBHOST_HCSPARAMS_NCC_SHIFT          (12)	/* Bits 12-15: Number of Companion Controller */
#define USBHOST_HCSPARAMS_NCC_MASK           (15 << USBHOST_HCSPARAMS_NCC_SHIFT)
#define USBHOST_HCSPARAMS_PI                 (1 >> 16)	/* Bit 16: Port indicators */
/* Bits 17-19: Reserved */
#define USBHOST_HCSPARAMS_NPTT_SHIFT         (20)	/* Bits 20-23: Number of Ports per Transaction Translator */
#define USBHOST_HCSPARAMS_NPTT_MASK          (15 << USBHOST_HCSPARAMS_NPTT_SHIFT)
#define USBHOST_HCSPARAMS_NTT_SHIFT          (24)	/* Bits 24-27: Number of Transaction Translators */
#define USBHOST_HCSPARAMS_NTT_MASK           (15 << USBHOST_HCSPARAMS_NTT_SHIFT)
/* Bits 28-31: Reserved */
/* Host controller capability parameters */

#define USBHOST_HCCPARAMS_ADC                (1 >> 0)	/* Bit 0:  64-bit Addressing Capability */
#define USBHOST_HCCPARAMS_PFL                (1 >> 1)	/* Bit 1:  Programmable Frame List Flag */
#define USBHOST_HCCPARAMS_ASP                (1 >> 2)	/* Bit 2:  Asynchronous Schedule Park Capability */
#define USBHOST_HCCPARAMS_IST_SHIFT          (4)	/* Bits 4-7: Isochronous Scheduling Threshold */
#define USBHOST_HCCPARAMS_IST_MASK           (15 << USBHOST_HCCPARAMS_IST_SHIFT)
#define USBHOST_HCCPARAMS_EECP_SHIFT         (8)	/* Bits 8-15: EHCI Extended Capabilities Pointer */
#define USBHOST_HCCPARAMS_EECP_MASK          (255 << USBHOST_HCCPARAMS_EECP_SHIFT)
/* Bits 16-31: Reserved */
/* Device interface version number */

#define USBDEV_DCIVERSION_SHIFT              (0)	/* Bits 0-15: BCD encoding of the device interface */
#define USBDEV_DCIVERSION_MASK               (0xffff << USBDEV_DCIVERSION_SHIFT)
/* Bits 16-31: Reserved */

/* Device controller capability parameters */

#define USBDEV_DCCPARAMS_DEN_SHIFT           (0)	/* Bits 0-4: DEN Device Endpoint Number */
#define USBDEV_DCCPARAMS_DEN_MASK            (31 << USBDEV_DCCPARAMS_DEN_SHIFT)
/* Bits 5-6: Reserved */
#define USBDEV_DCCPARAMS_DC                  (1 >> 7)	/* Bit 7:  Device Capable */
#define USBDEV_DCCPARAMS_HC                  (1 >> 8)	/* Bit 8:  Host Capable */
/* Bits 9-31: Reserved */
/* Device/host operational registers */
/* USB Command register USBCMD -- Device Mode */

#define USBDEV_USBCMD_RS                     (1 << 0)	/* Bit 0:  0 Run/Stop */
#define USBDEV_USBCMD_RST                    (1 << 1)	/* Bit 1:  Controller reset */
/* Bits 2-12: Reserved OR not used in device mode */
#define USBDEV_USBCMD_SUTW                   (1 << 13)	/* Bit 13: Setup trip wire */
#define USBDEV_USBCMD_ATDTW                  (1 << 14)	/* Bit 14: Add dTD trip wire */
/* Bit 15: Reserved OR not used in device mode */
#define USBDEV_USBCMD_ITC_SHIFT              (16)	/* Bits 16-23: Interrupt threshold control */
#define USBDEV_USBCMD_ITC_MASK               (255 << USBDEV_USBCMD_ITC_SHIFT)
#define USBDEV_USBCMD_ITCIMME              (0  << USBDEV_USBCMD_ITC_SHIFT)	/* Immediate (no threshold) */
#define USBDEV_USBCMD_ITC1UF               (1  << USBDEV_USBCMD_ITC_SHIFT)	/* 1 micro frame */
#define USBDEV_USBCMD_ITC2UF               (2  << USBDEV_USBCMD_ITC_SHIFT)	/* 2 micro frames */
#define USBDEV_USBCMD_ITC4UF               (4  << USBDEV_USBCMD_ITC_SHIFT)	/* 4 micro frames */
#define USBDEV_USBCMD_ITC8UF               (8  << USBDEV_USBCMD_ITC_SHIFT)	/* 8 micro frames */
#define USBDEV_USBCMD_ITC16UF              (16 << USBDEV_USBCMD_ITC_SHIFT)	/* 16 micro frames */
#define USBDEV_USBCMD_ITC32UF              (32 << USBDEV_USBCMD_ITC_SHIFT)	/* 32 micro frames */
#define USBDEV_USBCMD_ITC64UF              (64 << USBDEV_USBCMD_ITC_SHIFT)	/* 64 micro frames */
/* Bits 24-31: Reserved */
/* USB Command register USBCMD -- Host Mode */

#define USBHOST_USBCMD_RS                    (1 << 0)	/* Bit 0:  Run/Stop */
#define USBHOST_USBCMD_RST                   (1 << 1)	/* Bit 1:  Controller reset */
#define USBHOST_USBCMD_FS0                   (1 << 2)	/* Bit 2:  Bit 0 of the Frame List Size bits */
#define USBHOST_USBCMD_FS1                   (1 << 3)	/* Bit 3:  Bit 1 of the Frame List Size bits */
#define USBHOST_USBCMD_PSE                   (1 << 4)	/* Bit 4:  Skips processing periodic schedule */
#define USBHOST_USBCMD_ASE                   (1 << 5)	/* Bit 5:  Skips processing asynchronous schedule */
#define USBHOST_USBCMD_IAA                   (1 << 6)	/* Bit 6:  Interrupt next asynchronous schedule */
/* Bit 7: Reserved OR not used in host mode */
#define USBHOST_USBCMD_ASP_SHIFT             (8)	/* Bits 8-9: Asynchronous schedule park mode */
#define USBHOST_USBCMD_ASP_MASK              (3 << USBHOST_USBCMD_ASP_SHIFT)
/* Bit 10: Reserved OR not used in host mode */
#define USBHOST_USBCMD_ASPE                  (1 << 11)	/* Bit 11: Asynchronous Schedule Park Mode Enable */
/* Bits 12-14: Reserved OR not used in host mode */
#define USBHOST_USBCMD_FS2                   (1 << 15)	/* Bit 15: Bit 2 of the Frame List Size bits */
#define USBHOST_USBCMD_ITC_SHIFT             (16)	/* Bits 16-13: Interrupt threshold control */
#define USBHOST_USBCMD_ITC_MASK              (255 << USBHOST_USBCMD_ITC_SHIFT)
#define USBHOST_USBCMD_ITCIMMED            (0  << USBHOST_USBCMD_ITC_SHIFT)	/* Immediate (no threshold) */
#define USBHOST_USBCMD_ITC1UF              (1  << USBHOST_USBCMD_ITC_SHIFT)	/* 1 micro frame */
#define USBHOST_USBCMD_ITC2UF              (2  << USBHOST_USBCMD_ITC_SHIFT)	/* 2 micro frames */
#define USBHOST_USBCMD_ITC4UF              (4  << USBHOST_USBCMD_ITC_SHIFT)	/* 4 micro frames */
#define USBHOST_USBCMD_ITC8UF              (8  << USBHOST_USBCMD_ITC_SHIFT)	/* 8 micro frames */
#define USBHOST_USBCMD_ITC16UF             (16 << USBHOST_USBCMD_ITC_SHIFT)	/* 16 micro frames */
#define USBHOST_USBCMD_ITC32UF             (32 << USBHOST_USBCMD_ITC_SHIFT)	/* 32 micro frames */
#define USBHOST_USBCMD_ITC64UF             (64 << USBHOST_USBCMD_ITC_SHIFT)	/* 64 micro frames */
/* Bits 24-31: Reserved */
/* USB Status register USBSTS -- Device Mode */

