Samsung/TizenRT/os/arch/arm/src/imxrt/chip/imxrt_usb.h
#define USBDEV_USBSTS_UI                     (1 << 0)	/* Bit 0:  USB interrupt */
#define USBDEV_USBSTS_UEI                    (1 << 1)	/* Bit 1:  USB error interrupt */
#define USBDEV_USBSTS_PCI                    (1 << 2)	/* Bit 2:  Port change detect */
/* Bits 3-5: Reserved OR not used in device mode */
#define USBDEV_USBSTS_URI                    (1 << 6)	/* Bit 6:  USB reset received */
#define USBDEV_USBSTS_SRI                    (1 << 7)	/* Bit 7:  SOF received */
#define USBDEV_USBSTS_SLI                    (1 << 8)	/* Bit 8:  DCSuspend */
/* Bits 9-15: Reserved OR not used in device mode */
#define USBDEV_USBSTS_NAKI                   (1 << 16)	/* Bit 16: NAK interrupt bit */
/* Bits 17-31: Reserved OR not used in device mode */
/* USB Status register USBSTS -- Host Mode */

#define USBHOST_USBSTS_UI                    (1 << 0)	/* Bit 0:  USB interrupt */
#define USBHOST_USBSTS_UEI                   (1 << 1)	/* Bit 1:  USB error interrupt */
#define USBHOST_USBSTS_PCI                   (1 << 2)	/* Bit 2:  Port change detect */
#define USBHOST_USBSTS_FRI                   (1 << 3)	/* Bit 3:  Frame list roll-over */
/* Bit 4:  Reserved */
#define USBHOST_USBSTS_AAI                   (1 << 5)	/* Bit 5:  Interrupt on async advance */
/* Bit 6:  Not used in host mode */
#define USBHOST_USBSTS_SRI                   (1 << 7)	/* Bit 7:  SOF received */
/* Bit 8-11: Reserved OR Not used in host mode */
#define USBHOST_USBSTS_HCH                   (1 << 12)	/* Bit 12: HCHalted */
#define USBHOST_USBSTS_RCL                   (1 << 13)	/* Bit 13: Reclamation */
#define USBHOST_USBSTS_PS                    (1 << 14)	/* Bit 14: Periodic schedule status */
#define USBHOST_USBSTS_AS                    (1 << 15)	/* Bit 15: Asynchronous schedule status */
/* Bit 16-17: Reserved OR Not used in host mode */
#define USBHOST_USBSTS_UAI                   (1 << 18)	/* Bit 18: USB host asynchronous interrupt */
#define USBHOST_USBSTS_UPI                   (1 << 19)	/* Bit 19: USB host periodic interrupt */
/* Bits 20-31: Reserved */
/* USB interrupt register USBINTR -- Device Mode */

#define USBDEV_USBINTR_UE                    (1 << 0)	/* Bit 0:  USB interrupt enable */
#define USBDEV_USBINTR_UEE                   (1 << 1)	/* Bit 1:  USB error interrupt enable */
#define USBDEV_USBINTR_PCE                   (1 << 2)	/* Bit 2:  Port change detect enable */
/* Bits 3-5: Reserved OR Not used in device mode */
#define USBDEV_USBINTR_URE                   (1 << 6)	/* Bit 6:  USB reset enable */
#define USBDEV_USBINTR_SRE                   (1 << 7)	/* Bit 7:  SOF received enable */
#define USBDEV_USBINTR_SLE                   (1 << 8)	/* Bit 8:  Sleep enable */
/* Bits 8-15: Reserved */
#define USBDEV_USBINTR_NAKE                  (1 << 16)	/* Bit 16: NAK interrupt enable */
/* Bits 17-31: Reserved OR Not used in device mode */
/* USB interrupt register USBINTR -- Host Mode */

#define USBHOST_USBINTR_UE                   (1 << 0)	/* Bit 0:  USB interrupt enable */
#define USBHOST_USBINTR_UEE                  (1 << 1)	/* Bit 1:  USB error interrupt enable */
#define USBHOST_USBINTR_PCE                  (1 << 2)	/* Bit 2:  Port change detect enable */
#define USBHOST_USBINTR_FRE                  (1 << 3)	/* Bit 3:  Frame list rollover enable */
/* Bit 4:  Reserved */
#define USBHOST_USBINTR_AAE                  (1 << 5)	/* Bit 5:  Interrupt on asynchronous advance enable */
/* Bit 6:  Not used in host mode */
#define USBHOST_USBINTR_SRE                  (1 << 7)	/* Bit 7:  SOF timer interrupt enable */
/* Bits 8-17: Reserved OR Not used in host mode */
#define USBHOST_USBINTR_UAIE                 (1 << 18)	/* Bit 18: USB host asynchronous interrupt enable */
#define USBHOST_USBINTR_UPIA                 (1 << 19)	/* Bit 19: USB host periodic interrupt enable */
/* Bits 20-31:  Reserved */
/* Frame index register FRINDEX -- Device Mode */

#define USBDEV_FRINDEX_CUFN_SHIFT            (0)	/* Bits 0-2: Current micro frame number */
#define USBDEV_FRINDEX_CUFN_MASK             (7 << USBDEV_FRINDEX_CUFN_SHIFT)
#define USBDEV_FRINDEX_LFN_SHIFT             (3)	/* Bits 3-13: Frame number of last frame transmitted */
#define USBDEV_FRINDEX_LFN_MASK              (0x7ff << USBDEV_FRINDEX_LFN_SHIFT)
/* Bits 14-31:  Reserved */
/* Frame index register FRINDEX -- Host Mode */

#define USBHOST_FRINDEX_CUFN_SHIFT           (0)	/* Bits 0-2: Current micro frame number */
#define USBHOST_FRINDEX_CUFN_MASK            (7 << USBHOST_FRINDEX_CUFN_SHIFT)
#define USBHOST_FRINDEX_FLI_SHIFT            (3)	/* Bits 3-12: Frame list current index */
#define USBHOST_FRINDEX_FLI_MASK             (0x3ff << USBHOST_FRINDEX_FLI_SHIFT)
/* Bits 13-31:  Reserved */
/* USB Device Address register DEVICEADDR -- Device Mode */
/* Bits 0-23:  Reserved */
#define USBDEV_DEVICEADDR_USBADRA            (1 << 24)	/* Bit 24: Device address advance */
#define USBDEV_DEVICEADDR_SHIFT              (25)	/* Bits 25-31: USBADR USB device address */
#define USBDEV_DEVICEADDR_MASK               (0x3f << USBDEV_DEVICEADDR_SHIFT)

/* USB Periodic List Base register PERIODICLIST -- Host Mode */
/* Bits 0-11:  Reserved */
#define USBHOST_PERIODICLIST_PERBASE_SHIFT   (12)	/* Bits 12-31: Base Address (Low) */
#define USBHOST_PERIODICLIST_PERBASE_MASK    (0x000fffff << USBHOST_PERIODICLIST_PERBASE_SHIFT)

/* USB Endpoint List Address register ENDPOINTLISTADDR -- Device Mode */
/* Bits 0-10:  Reserved */
#define USBDEV_ENDPOINTLIST_EPBASE_SHIFT     (11)	/* Bits 11-31: Endpoint list pointer (low) */
#define USBDEV_ENDPOINTLIST_EPBASE_MASK      (0x001fffff << USBDEV_ENDPOINTLIST_EPBASE_SHIFT)

/* USB Asynchronous List Address register ASYNCLISTADDR -- Host Mode */
/* Bits 0-4:  Reserved */
#define USBHOST_ASYNCLISTADDR_ASYBASE_SHIFT  (5)	/* Bits 5-31: Link pointer (Low) LPL */
#define USBHOST_ASYNCLISTADDR_ASYBASE_MASK   (0x07ffffff << USBHOST_ASYNCLISTADDR_ASYBASE_SHIFT)

/* USB TT Control register TTCTRL -- Host Mode */
/* Bits 0-23:  Reserved */
#define USBHOST_TTCTRL_TTHA_SHIFT            (24)	/* Bits 24-30: Hub address */
#define USBHOST_TTCTRL_TTHA_MASK             (0x7f << USBHOST_TTCTRL_TTHA_SHIFT)

/* USB burst size register BURSTSIZE -- Device/Host Mode */

#define USBHOST_BURSTSIZE_RXPBURST_SHIFT     (0)	/* Bits 0-7: RXPBURST Programmable RX burst length */
#define USBHOST_BURSTSIZE_RXPBURST_MASK      (255 << USBHOST_BURSTSIZE_RXPBURST_SHIFT)
#define USBHOST_BURSTSIZE_TXPBURST_SHIFT     (8)	/* Bits 8-15: Programmable TX burst length */
#define USBHOST_BURSTSIZE_TXPBURST_MASK      (255 << USBHOST_BURSTSIZE_TXPBURST_SHIFT)
/* Bits 16-31: Reserved */

#define USBDEV_BURSTSIZE_RXPBURST_SHIFT      (0)	/* Bits 0-7: RXPBURST Programmable RX burst length */
#define USBDEV_BURSTSIZE_RXPBURST_MASK       (255 << USBDEV_BURSTSIZE_RXPBURST_SHIFT)
#define USBDEV_BURSTSIZE_TXPBURST_SHIFT      (8)	/* Bits 8-15: Programmable TX burst length */
#define USBDEV_BURSTSIZE_TXPBURST_MASK       (255 << USBDEV_BURSTSIZE_TXPBURST_SHIFT)
/* Bits 16-31: Reserved */
/* USB Transfer buffer Fill Tuning register TXFIFOFILLTUNING -- Host Mode */

#define USBHOST_TXFILLTUNING_SCHOH_SHIFT     (0)	/* Bits 0-7: FIFO burst threshold */
#define USBHOST_TXFILLTUNING_SCHOH_MASK      (0xff << USBHOST_TXFILLTUNING_SCHOH_SHIFT)
#define USBHOST_TXFILLTUNING_SCHEATLTH_SHIFT (8)	/* Bits 8-12: Scheduler health counter */
#define USBHOST_TXFILLTUNING_SCHEATLTH_MASK  (0x1f << USBHOST_TXFILLTUNING_SCHEATLTH_SHIFT)
#define USBHOST_TXFILLTUNING_FIFOTHRES_SHIFT (16)	/* Bits 16-21: Scheduler overhead */
#define USBHOST_TXFILLTUNING_FIFOTHRES_MASK  (0x3f << USBHOST_TXFILLTUNING_FIFOTHRES_SHIFT)
/* Bits 22-31: Reserved */
/* USB BINTERVAL register BINTERVAL -- Device/Host Mode */

#define USBDEV_BINTERVAL_SHIFT               (0)	/* Bits 0-3: bInterval value */
#define USBDEV_BINTERVAL_MASK                (15 << USBDEV_BINTERVAL_SHIFT)
/* Bits 4-31: Reserved */

#define USBHOST_BINTERVAL_SHIFT              (0)	/* Bits 0-3: bInterval value */
#define USBHOST_BINTERVAL_MASK               (15 << USBHOST_BINTERVAL_SHIFT)
/* Bits 4-31: Reserved */
/* USB endpoint NAK register ENDPTNAK -- Device Mode */

#define USBDEV_ENDPTNAK_EPRN_SHIFT           (0)	/* Bits 0-5: Rx endpoint NAK */
#define USBDEV_ENDPTNAK_EPRN_MASK            (0x3f << USBDEV_ENDPTNAK_EPRN_SHIFT)
/* Bits 6-15: Reserved */
#define USBDEV_ENDPTNAK_EPTN_SHIFT           (16)	/* Bits 16-21: Tx endpoint NAK */
#define USBDEV_ENDPTNAK_EPTN_MASK            (0x3f << USBDEV_ENDPTNAK_EPTN_SHIFT)
/* Bits 22-31: Reserved */
/* USB Endpoint NAK Enable register ENDPTNAKEN -- Device Mode */

