Samsung/TizenRT/os/arch/arm/src/imxrt/chip/imxrt_usb.h
#define USBDEV_ENDPTNAK_EPRNE_SHIFT          (0)	/* Bits 0-5: Rx endpoint NAK enable */
#define USBDEV_ENDPTNAK_EPRNE_MASK           (0x3f << USBDEV_ENDPTNAK_EPRNE_SHIFT)
/* Bits 6-15: Reserved */
#define USBDEV_ENDPTNAK_EPTNE_SHIFT          (16)	/* Bits 16-21: Tx endpoint NAK enable */
#define USBDEV_ENDPTNAK_EPTNE_MASK           (0x3f << USBDEV_ENDPTNAK_EPTNE_SHIFT)
/* Bits 22-31: Reserved */
/* Port Status and Control register PRTSC1 -- Device Mode */

#define USBDEV_PRTSC1_CCS                    (1 << 0)	/* Bit 0:  Current connect status */
/* Bit 1:  Not used in device mode */
#define USBDEV_PRTSC1_PE                     (1 << 2)	/* Bit 2:  Port enable */
#define USBDEV_PRTSC1_PEC                    (1 << 3)	/* Bit 3:  Port enable/disable change */
#define USBDEV_PRTSC1_FPR                    (1 << 6)	/* Bit 6:  Force port resume */
#define USBDEV_PRTSC1_SUSP                   (1 << 7)	/* Bit 7:  Suspend */
#define USBDEV_PRTSC1_PR                     (1 << 8)	/* Bit 8:  Port reset */
#define USBDEV_PRTSC1_HSP                    (1 << 9)	/* Bit 9:  High-speed status */
/* Bits 10-13: Reserved OR not used in device mode */
#define USBDEV_PRTSC1_PIC_SHIFT              (14)	/* Bits 14-15: Port indicator control */
#define USBDEV_PRTSC1_PIC_MASK               (3 << USBDEV_PRTSC1_PIC_SHIFT)
#define USBDEV_PRTSC1_PIC_OFF              (0 << USBDEV_PRTSC1_PIC_SHIFT)	/* 00 Port indicators are off */
#define USBDEV_PRTSC1_PIC_AMBER            (1 << USBDEV_PRTSC1_PIC_SHIFT)	/* 01 amber */
#define USBDEV_PRTSC1_PIC_GREEN            (2 << USBDEV_PRTSC1_PIC_SHIFT)	/* 10 green */
#define USBDEV_PRTSC1_PTC_SHIFT              (16)	/* Bits 16-19: 19: Port test control */
#define USBDEV_PRTSC1_PTC_MASK               (15 << USBDEV_PRTSC1_PTC_SHIFT)
#define USBDEV_PRTSC1_PTC_DISABLE          (0 << USBDEV_PRTSC1_PTC_SHIFT)	/* TEST_MODE_DISABLE */
#define USBDEV_PRTSC1_PTC_JSTATE           (1 << USBDEV_PRTSC1_PTC_SHIFT)	/* J_STATE */
#define USBDEV_PRTSC1_PTC_KSTATE           (2 << USBDEV_PRTSC1_PTC_SHIFT)	/* K_STATE */
#define USBDEV_PRTSC1_PTC_SE0              (3 << USBDEV_PRTSC1_PTC_SHIFT)	/* SE0 (host)/NAK (device) */
#define USBDEV_PRTSC1_PTC_PACKET           (4 << USBDEV_PRTSC1_PTC_SHIFT)	/* Packet */
#define USBDEV_PRTSC1_PTC_HS               (5 << USBDEV_PRTSC1_PTC_SHIFT)	/* FORCE_ENABLE_HS */
#define USBDEV_PRTSC1_PTC_FS               (6 << USBDEV_PRTSC1_PTC_SHIFT)	/* FORCE_ENABLE_FS */
/* Bits 20-22:  Not used in device mode */
#define USBDEV_PRTSC1_PHCD                   (1 << 23)	/* Bit 23: PHY low power suspend - clock disable (PLPSCD) */
#define USBDEV_PRTSC1_PFSC                 (1 << 24)	/* Bit 24: Port force full speed connect */
/* Bit 25: Reserved */
#define USBDEV_PRTSC1_PSPD_SHIFT             (26)	/* Bits 26-27: Port speed */
#define USBDEV_PRTSC1_PSPD_MASK              (3 << USBDEV_PRTSC1_PSPD_SHIFT)
#define USBDEV_PRTSC1_PSPD_FS              (0 << USBDEV_PRTSC1_PSPD_SHIFT)	/* Full-speed */
#define USBDEV_PRTSC1_PSPD_LS              (0 << USBDEV_PRTSC1_PSPD_SHIFT)	/* Full-speed */
#define USBDEV_PRTSC1_PSPD_HS              (2 << USBDEV_PRTSC1_PSPD_SHIFT)	/* High-speed */
/* Bits 28-31: Reserved */
/* Port Status and Control register PRTSC1 -- Host Mode */

#define USBHOST_PRTSC1_CCS                   (1 << 0)	/* Bit 0:  Current connect status */
#define USBHOST_PRTSC1_CSC                   (1 << 1)	/* Bit 1:  Connect status change */
#define USBHOST_PRTSC1_PE                    (1 << 2)	/* Bit 2:  Port enable */
#define USBHOST_PRTSC1_PEC                   (1 << 3)	/* Bit 3:  Port disable/enable change */
#define USBHOST_PRTSC1_OCA                   (1 << 4)	/* Bit 4:  Over-current active */
#define USBHOST_PRTSC1_OCC                   (1 << 5)	/* Bit 5:  Over-current change */
#define USBHOST_PRTSC1_FPR                   (1 << 6)	/* Bit 6:  Force port resume */
#define USBHOST_PRTSC1_SUSP                  (1 << 7)	/* Bit 7:  Suspend */
#define USBHOST_PRTSC1_PR                    (1 << 8)	/* Bit 8:  Port reset */
#define USBHOST_PRTSC1_HSP                   (1 << 9)	/* Bit 9:  High-speed status */
#define USBHOST_PRTSC1_LS_SHIFT              (10)	/* Bits 10-11: Line status */
#define USBHOST_PRTSC1_LS_MASK               (3 << USBHOST_PRTSC1_LS_SHIFT)
#define USBHOST_PRTSC1_LS_SE0              (0 << USBHOST_PRTSC1_LS_SHIFT)	/* SE0 (USB_DP and USB_DM LOW) */
#define USBHOST_PRTSC1_LS_JSTATE           (2 << USBHOST_PRTSC1_LS_SHIFT)	/* J-state (USB_DP HIGH and USB_DM LOW) */
#define USBHOST_PRTSC1_LS_KSTATE           (1 << USBHOST_PRTSC1_LS_SHIFT)	/* K-state (USB_DP LOW and USB_DM HIGH) */
#define USBHOST_PRTSC1_PP                    (1 << 12)	/* Bit 12: Port power control */
/* Bit 13: Reserved */
#define USBHOST_PRTSC1_PIC_SHIFT             (14)	/* Bits 14-15: Port indicator control */
#define USBHOST_PRTSC1_PIC_MASK              (3 << USBHOST_PRTSC1_PIC_SHIFT)
#define USBHOST_PRTSC1_PIC_OFF             (0 << USBHOST_PRTSC1_PIC_SHIFT)	/* 00 Port indicators are off */
#define USBHOST_PRTSC1_PIC_AMBER           (1 << USBHOST_PRTSC1_PIC_SHIFT)	/* 01 Amber */
#define USBHOST_PRTSC1_PIC_GREEN           (2 << USBHOST_PRTSC1_PIC_SHIFT)	/* 10 Green */
#define USBHOST_PRTSC1_PTC_SHIFT             (16)	/* Bits 16-19: Port test control */
#define USBHOST_PRTSC1_PTC_MASK              (15 << USBHOST_PRTSC1_PTC_SHIFT)
#define USBHOST_PRTSC1_PTC_DISABLE         (0 << USBHOST_PRTSC1_PTC_SHIFT)	/* 0000 TEST_MODE_DISABLE */
#define USBHOST_PRTSC1_PTC_JSTATE          (1 << USBHOST_PRTSC1_PTC_SHIFT)	/* 0001 J_STATE */
#define USBHOST_PRTSC1_PTC_KSTATE          (2 << USBHOST_PRTSC1_PTC_SHIFT)	/* 0010 K_STATE */
#define USBHOST_PRTSC1_PTC_SE0             (3 << USBHOST_PRTSC1_PTC_SHIFT)	/* 0011 SE0 (host)/NAK (device) */
#define USBHOST_PRTSC1_PTC_PACKET          (4 << USBHOST_PRTSC1_PTC_SHIFT)	/* 0100 Packet */
#define USBHOST_PRTSC1_PTC_HS              (5 << USBHOST_PRTSC1_PTC_SHIFT)	/* 0101 FORCE_ENABLE_HS */
#define USBHOST_PRTSC1_PTC_FS              (6 << USBHOST_PRTSC1_PTC_SHIFT)	/* 0110 FORCE_ENABLE_FS */
#define USBHOST_PRTSC1_PTC_LS              (7 << USBHOST_PRTSC1_PTC_SHIFT)	/* 0111 FORCE_ENABLE_LS */
#define USBHOST_PRTSC1_WKCN                  (1 << 20)	/* Bit 20: Wake on connect enable (WKCNNT_E) */
#define USBHOST_PRTSC1_WKDC                  (1 << 21)	/* Bit 21: Wake on disconnect enable (WKDSCNNT_E) */
#define USBHOST_PRTSC1_WKOC                  (1 << 22)	/* Bit 22: Wake on over-current enable (WKOC_E) */
#define USBHOST_PRTSC1_PHCD                  (1 << 23)	/* Bit 23: PHY low power suspend - clock disable (PLPSCD) */
#define USBHOST_PRTSC1_PFSC                  (1 << 24)	/* Bit 24: Port force full speed connect */
/* Bit 25: Reserved */
#define USBHOST_PRTSC1_PSPD_SHIFT            (26)	/* Bits 26-27: Port speed */
#define USBHOST_PRTSC1_PSPD_MASK             (3 << USBHOST_PRTSC1_PSPD_SHIFT)
#define USBHOST_PRTSC1_PSPD_FS             (0 << USBHOST_PRTSC1_PSPD_SHIFT)	/* Full-speed */
#define USBHOST_PRTSC1_PSPD_LS             (1 << USBHOST_PRTSC1_PSPD_SHIFT)	/* Low-speed */
#define USBHOST_PRTSC1_PSPD_HS             (2 << USBHOST_PRTSC1_PSPD_SHIFT)	/* High-speed */
/* Bits 28-31: Reserved */
/* OTG Status and Control register */
/* OTG controls */

