Samsung/TizenRT/os/arch/arm/src/imxrt/chip/imxrt_usb.h
#define USBOTG_OTGSC_VD                      (1 << 0)	/* Bit 0:  VBUS_Discharge */
#define USBOTG_OTGSC_VC                      (1 << 1)	/* Bit 1:  VBUS_Charge */
#define USBOTG_OTGSC_HAAR                    (1 << 2)	/* Bit 2:  Hardware assist auto_reset */
#define USBOTG_OTGSC_OT                      (1 << 3)	/* Bit 3:  OTG termination */
#define USBOTG_OTGSC_DP                      (1 << 4)	/* Bit 4:  Data pulsing */
#define USBOTG_OTGSC_IDPU                    (1 << 5)	/* Bit 5:  ID pull-up */
#define USBOTG_OTGSC_HADP                    (1 << 6)	/* Bit 6:  Hardware assist data pulse */
#define USBOTG_OTGSC_HABA                    (1 << 7)	/* Bit 7:  Hardware assist B-disconnect to A-connect */

/* OTG status inputs */

#define USBOTG_OTGSC_ID                      (1 << 8)	/* Bit 8:  USB ID */
#define USBOTG_OTGSC_AVV                     (1 << 9)	/* Bit 9:  A-VBUS valid */
#define USBOTG_OTGSC_ASV                     (1 << 10)	/* Bit 10: A-session valid */
#define USBOTG_OTGSC_BSV                     (1 << 11)	/* Bit 11: B-session valid */
#define USBOTG_OTGSC_BSE                     (1 << 12)	/* Bit 12: B-session end */
#define USBOTG_OTGSC_1MST                    (1 << 13)	/* Bit 13: 1 millisecond timer toggle */
#define USBOTG_OTGSC_DPS                     (1 << 14)	/* Bit 14: Data bus pulsing status */
/* Bit 15: Reserved */
/* OTG interrupt status */

#define USBOTG_OTGSC_IDIS                    (1 << 16)	/* Bit 16: USB ID interrupt status */
#define USBOTG_OTGSC_AVVIS                   (1 << 17)	/* Bit 17: A-VBUS valid interrupt status */
#define USBOTG_OTGSC_ASVIS                   (1 << 18)	/* Bit 18: A-Session valid interrupt status */
#define USBOTG_OTGSC_BSVIS                   (1 << 19)	/* Bit 19: B-Session valid interrupt status */
#define USBOTG_OTGSC_BSEIS                   (1 << 20)	/* Bit 20: B-Session end interrupt status */
#define USBOTG_OTGSC_MS1S                    (1 << 21)	/* Bit 21: 1 millisecond timer interrupt status */
#define USBOTG_OTGSC_DPIS                    (1 << 22)	/* Bit 22: Data pulse interrupt status */
/* Bit 23: Reserved */
/* OTG interrupt enable */

#define USBOTG_OTGSC_IDIE                    (1 << 24)	/* Bit 24: USB ID interrupt enable */
#define USBOTG_OTGSC_AVVIE                   (1 << 25)	/* Bit 25: A-VBUS valid interrupt enable */
#define USBOTG_OTGSC_ASVIE                   (1 << 26)	/* Bit 26: A-session valid interrupt enable */
#define USBOTG_OTGSC_BSVIE                   (1 << 27)	/* Bit 27: B-session valid interrupt enable */
#define USBOTG_OTGSC_BSEIE                   (1 << 28)	/* Bit 28: B-session end interrupt enable */
#define USBOTG_OTGSC_MS1E                    (1 << 29)	/* Bit 29: 1 millisecond timer interrupt enable */
#define USBOTG_OTGSC_DPIE                    (1 << 30)	/* Bit 30: Data pulse interrupt enable */
/* Bit 31: Reserved */
/* USB Mode register USBMODE -- Device Mode */

#define USBDEV_USBMODE_CM_SHIFT              (0)	/* Bits 0-1: Controller mode */
#define USBDEV_USBMODE_CM_MASK               (3 << USBDEV_USBMODE_CM_SHIFT)
#define USBDEV_USBMODE_CM_IDLE             (0 << USBDEV_USBMODE_CM_SHIFT)	/* Idle */
#define USBDEV_USBMODE_CM_DEVICE           (2 << USBDEV_USBMODE_CM_SHIFT)	/* Device controller */
#define USBDEV_USBMODE_CM_HOST             (3 << USBDEV_USBMODE_CM_SHIFT)	/* Host controller */
#define USBDEV_USBMODE_ES                    (1 << 2)	/* Bit 2:  Endian select */
#define USBDEV_USBMODE_SLOM                  (1 << 3)	/* Bit 3:  Setup Lockout mode */
#define USBDEV_USBMODE_SDIS                  (1 << 4)	/* Bit 4:  Stream disable mode */
/* Bits 5-31:  Reserved OR not used in device mode */

/* USB Mode register USBMODE -- Host Mode */

#define USBHOST_USBMODE_CM_SHIFT             (0)	/* Bits 0-1: Controller mode */
#define USBHOST_USBMODE_CM_MASK              (3 << USBHOST_USBMODE_CM_SHIFT)
#define USBHOST_USBMODE_CM_IDLE            (0 << USBHOST_USBMODE_CM_SHIFT)	/* Idle */
#define USBHOST_USBMODE_CM_DEVICE          (2 << USBHOST_USBMODE_CM_SHIFT)	/* Device controller */
#define USBHOST_USBMODE_CM_HOST            (3 << USBHOST_USBMODE_CM_SHIFT)	/* Host controller */
#define USBHOST_USBMODE_ES                   (1 << 2)	/* Bit 2:  Endian select */
/* Bit 3:  Not used in host mode */
#define USBHOST_USBMODE_SDIS                 (1 << 4)	/* Bit 4:  Stream disable mode */
#define USBHOST_USBMODE_VBPS                 (1 << 5)	/* Bit 5:  VBUS power select */
/* Bits 6-31: Reserved */
/* Device endpoint registers */

/* USB Endpoint Setup Status register ENDPTSETUPSTAT */

#define USBDEV_ENDPTSETSTAT_STAT(n)          (1 << (n))
#define USBDEV_ENDPTSETSTAT_STAT0            (1 << 0)	/* Bit 0:  Setup EP status for logical EP 0 */
#define USBDEV_ENDPTSETSTAT_STAT1            (1 << 1)	/* Bit 1:  Setup EP status for logical EP 1 */
#define USBDEV_ENDPTSETSTAT_STAT2            (1 << 2)	/* Bit 2:  Setup EP status for logical EP 2 */
#define USBDEV_ENDPTSETSTAT_STAT3            (1 << 3)	/* Bit 3:  Setup EP status for logical EP 3 */
#define USBDEV_ENDPTSETSTAT_STAT4            (1 << 4)	/* Bit 4:  Setup EP status for logical EP 4 */
#define USBDEV_ENDPTSETSTAT_STAT5            (1 << 5)	/* Bit 5:  Setup EP status for logical EP 5 */
/* Bits 6-31: Reserved */
/* USB Endpoint Prime register ENDPTPRIME */

#define USBDEV_ENDPTPRIM_PERB(n)             (1 << (n))
#define USBDEV_ENDPTPRIM_PERB0               (1 << 0)	/* Bit 0:  Prime EP recv buffer for physical OUT EP 0 */
#define USBDEV_ENDPTPRIM_PERB1               (1 << 1)	/* Bit 1:  Prime EP recv buffer for physical OUT EP 1 */
#define USBDEV_ENDPTPRIM_PERB2               (1 << 2)	/* Bit 2:  Prime EP recv buffer for physical OUT EP 2 */
#define USBDEV_ENDPTPRIM_PERB3               (1 << 3)	/* Bit 3:  Prime EP recv buffer for physical OUT EP 3 */
#define USBDEV_ENDPTPRIM_PERB4               (1 << 4)	/* Bit 4:  Prime EP recv buffer for physical OUT EP 4 */
#define USBDEV_ENDPTPRIM_PERB5               (1 << 5)	/* Bit 5:  Prime EP recv buffer for physical OUT EP 5 */
/* Bits 6-15: Reserved */
#define USBDEV_ENDPTPRIM_PETB(n)             (1 << ((n) + 16))
#define USBDEV_ENDPTPRIM_PETB0               (1 << 16)	/* Bit 16: Prime EP xmt buffer for physical IN EP 0 */
#define USBDEV_ENDPTPRIM_PETB1               (1 << 17)	/* Bit 17: Prime EP xmt buffer for physical IN EP 1 */
#define USBDEV_ENDPTPRIM_PETB2               (1 << 18)	/* Bit 18: Prime EP xmt buffer for physical IN EP 2 */
#define USBDEV_ENDPTPRIM_PETB3               (1 << 19)	/* Bit 19: Prime EP xmt buffer for physical IN EP 3 */
#define USBDEV_ENDPTPRIM_PETB4               (1 << 20)	/* Bit 20: Prime EP xmt buffer for physical IN EP 4 */
#define USBDEV_ENDPTPRIM_PETB5               (1 << 21)	/* Bit 21: Prime EP xmt buffer for physical IN EP 5 */
/* Bits 22-31: Reserved */
/* USB Endpoint Flush register ENDPTFLUSH */

