Samsung/TizenRT/os/arch/arm/src/imxrt/chip/imxrt_usb.h
#define USBDEV_ENDPTFLUSH_FERB(n)            (1 << (n))
#define USBDEV_ENDPTFLUSH_FERB0              (1 << 0)	/* Bit 0:  Flush EP recv buffer for physical OUT EP 0 */
#define USBDEV_ENDPTFLUSH_FERB1              (1 << 1)	/* Bit 1:  Flush EP recv buffer for physical OUT EP 1 */
#define USBDEV_ENDPTFLUSH_FERB2              (1 << 2)	/* Bit 2:  Flush EP recv buffer for physical OUT EP 2 */
#define USBDEV_ENDPTFLUSH_FERB3              (1 << 3)	/* Bit 3:  Flush EP recv buffer for physical OUT EP 3 */
#define USBDEV_ENDPTFLUSH_FERB4              (1 << 4)	/* Bit 4:  Flush EP recv buffer for physical OUT EP 4 */
#define USBDEV_ENDPTFLUSH_FERB5              (1 << 5)	/* Bit 5:  Flush EP recv buffer for physical OUT EP 5 */
/* Bits 6-15: Reserved */
#define USBDEV_ENDPTFLUSH_FETB(n)            (1 << ((n) + 16))
#define USBDEV_ENDPTFLUSH_FETB0              (1 << 16)	/* Bit 16: Flush EP xmt buffer for physical IN EP 0 */
#define USBDEV_ENDPTFLUSH_FETB1              (1 << 17)	/* Bit 17: Flush EP xmt buffer for physical IN EP 1 */
#define USBDEV_ENDPTFLUSH_FETB2              (1 << 18)	/* Bit 18: Flush EP xmt buffer for physical IN EP 2 */
#define USBDEV_ENDPTFLUSH_FETB3              (1 << 19)	/* Bit 19: Flush EP xmt buffer for physical IN EP 3 */
#define USBDEV_ENDPTFLUSH_FETB4              (1 << 20)	/* Bit 20: Flush EP xmt buffer for physical IN EP 4 */
#define USBDEV_ENDPTFLUSH_FETB5              (1 << 21)	/* Bit 21: Flush EP xmt buffer for physical IN EP 5 */
/* Bits 22-31: Reserved */
/* USB Endpoint Status register ENDPTSTATUS */

#define USBDEV_ENDPTSTATUS_ERBR(n)           (1 << (n))
#define USBDEV_ENDPTSTATUS_ERBR0             (1 << 0)	/* Bit 0:  EP recv buffer ready for physical OUT EP 0 */
#define USBDEV_ENDPTSTATUS_ERBR1             (1 << 1)	/* Bit 1:  EP recv buffer ready for physical OUT EP 1 */
#define USBDEV_ENDPTSTATUS_ERBR2             (1 << 2)	/* Bit 2:  EP recv buffer ready for physical OUT EP 2 */
#define USBDEV_ENDPTSTATUS_ERBR3             (1 << 3)	/* Bit 3:  EP recv buffer ready for physical OUT EP 3 */
#define USBDEV_ENDPTSTATUS_ERBR4             (1 << 4)	/* Bit 4:  EP recv buffer ready for physical OUT EP 4 */
#define USBDEV_ENDPTSTATUS_ERBR5             (1 << 5)	/* Bit 5:  EP recv buffer ready for physical OUT EP 5 */
/* Bits 6-15: Reserved */
#define USBDEV_ENDPTSTATUS_ETBR(n)           (1 << ((n) + 16))
#define USBDEV_ENDPTSTATUS_ETBR0             (1 << 16)	/* Bit 16: EP xmt buffer ready for physical IN EP 0 */
#define USBDEV_ENDPTSTATUS_ETBR1             (1 << 17)	/* Bit 17: EP xmt buffer ready for physical IN EP 1 */
#define USBDEV_ENDPTSTATUS_ETBR2             (1 << 18)	/* Bit 18: EP xmt buffer ready for physical IN EP 2 */
#define USBDEV_ENDPTSTATUS_ETBR3             (1 << 19)	/* Bit 19: EP xmt buffer ready for physical IN EP 3 */
#define USBDEV_ENDPTSTATUS_ETBR4             (1 << 20)	/* Bit 20: EP xmt buffer ready for physical IN EP 4 */
#define USBDEV_ENDPTSTATUS_ETBR5             (1 << 21)	/* Bit 21: EP xmt buffer ready for physical IN EP 5 */
/* Bits 22-31: Reserved */
/* USB Endpoint Complete register ENDPTCOMPLETE */

#define USBDEV_ENDPTCOMPLETE_ERCE(n)         (1 << (n))
#define USBDEV_ENDPTCOMPLETE_ERCE0           (1 << 0)	/* Bit 0:  EP recv complete event for physical OUT EP 0 */
#define USBDEV_ENDPTCOMPLETE_ERCE1           (1 << 1)	/* Bit 1:  EP recv complete event for physical OUT EP 1 */
#define USBDEV_ENDPTCOMPLETE_ERCE2           (1 << 2)	/* Bit 2:  EP recv complete event for physical OUT EP 2 */
#define USBDEV_ENDPTCOMPLETE_ERCE3           (1 << 3)	/* Bit 3:  EP recv complete event for physical OUT EP 3 */
#define USBDEV_ENDPTCOMPLETE_ERCE4           (1 << 4)	/* Bit 4:  EP recv complete event for physical OUT EP 4 */
#define USBDEV_ENDPTCOMPLETE_ERCE5           (1 << 5)	/* Bit 4:  EP recv complete event for physical OUT EP 5 */
/* Bits 6-15: Reserved */
#define USBDEV_ENDPTCOMPLETE_ETCE(n)         (1 << ((n) + 16))
#define USBDEV_ENDPTCOMPLETE_ETCE0           (1 << 16)	/* Bit 16: EP xmt complete event for physical IN EP 0 */
#define USBDEV_ENDPTCOMPLETE_ETCE1           (1 << 17)	/* Bit 17: EP xmt complete event for physical IN EP 1 */
#define USBDEV_ENDPTCOMPLETE_ETCE2           (1 << 18)	/* Bit 18: EP xmt complete event for physical IN EP 2 */
#define USBDEV_ENDPTCOMPLETE_ETCE3           (1 << 19)	/* Bit 19: EP xmt complete event for physical IN EP 3 */
#define USBDEV_ENDPTCOMPLETE_ETCE4           (1 << 20)	/* Bit 20: EP xmt complete event for physical IN EP 4 */
#define USBDEV_ENDPTCOMPLETE_ETCE5           (1 << 21)	/* Bit 21: EP xmt complete event for physical IN EP 5 */
/* Bits 22-31: Reserved */
/* USB Endpoint 0 Control register ENDPTCTRL0 */

#define USBDEV_ENDPTCTRL0_RXS                (1 << 0)	/* Bit 0:  Rx endpoint stall */
/* Bit 1:  Reserved */
#define USBDEV_ENDPTCTRL0_RXT_SHIFT          (2)	/* Bits 2-3: Endpoint type */
#define USBDEV_ENDPTCTR0L_RXT_MASK           (3 << USBDEV_ENDPTCTRL0_RXT_SHIFT)
#define USBDEV_ENDPTCTRL0_RXT_CTRL         (0 << USBDEV_ENDPTCTRL0_RXT_SHIFT)	/* Control */
/* Bits 4-6: Reserved */
#define USBDEV_ENDPTCTRL0_RXE                (1 << 7)	/* Bit 7:  Rx endpoint enable */
/* Bits 8-15: Reserved */
#define USBDEV_ENDPTCTRL0_TXS                (1 << 16)	/* Bit 16: Tx endpoint stall */
/* Bit 17: Reserved */
#define USBDEV_ENDPTCTRL0_TXT_SHIFT          (18)	/* Bits 18-19: Tx endpoint type */
#define USBDEV_ENDPTCTRL0_TXT_MASK           (3 << USBDEV_ENDPTCTRL0_TXT_SHIFT)
#define USBDEV_ENDPTCTRL0_TXT_CTRL         (0 << USBDEV_ENDPTCTRL0_TXT_SHIFT)	/* Control */
#define USBDEV_ENDPTCTRL0_TXE                (1 << 23)	/* Bit 23: Tx endpoint enable */
/* Bits 24-31: Reserved */
/* USB Endpoint 1-3 control registers ENDPTCTRL1-ENDPPTCTRL5 */

#define USBDEV_ENDPTCTRL_RXS                 (1 << 0)	/* Bit 0:  Rx endpoint stall */
/* Bit 1:  Reserved */
#define USBDEV_ENDPTCTRL_RXT_SHIFT           (2)	/* Bits 2-3: Endpoint type */
#define USBDEV_ENDPTCTRL_RXT_MASK            (3 << USBDEV_ENDPTCTRL_RXT_SHIFT)
#define USBDEV_ENDPTCTRL_RXT_CTRL          (0 << USBDEV_ENDPTCTRL_RXT_SHIFT)	/* Control */
#define USBDEV_ENDPTCTRL_RXT_ISOC          (1 << USBDEV_ENDPTCTRL_RXT_SHIFT)	/* Isochronous */
#define USBDEV_ENDPTCTRL_RXT_BULK          (2 << USBDEV_ENDPTCTRL_RXT_SHIFT)	/* Bulk */
#define USBDEV_ENDPTCTRL_RXT_INTR          (3 << USBDEV_ENDPTCTRL_RXT_SHIFT)	/* Interrupt */
/* Bit 4:  Reserved */
#define USBDEV_ENDPTCTRL_RXI                 (1 << 5)	/* Bit 5:  Rx data toggle inhibit */
#define USBDEV_ENDPTCTRL_RXR                 (1 << 6)	/* Bit 6:  Rx data toggle reset */
#define USBDEV_ENDPTCTRL_RXE                 (1 << 7)	/* Bit 7:  Rx endpoint enable */
/* Bits 8-15: Reserved */
#define USBDEV_ENDPTCTRL_TXS                 (1 << 16)	/* Bit 16: Tx endpoint stall */
/* Bit 17: Reserved */
#define USBDEV_ENDPTCTRL_TXT_SHIFT           (18)	/* Bits 18-19: Tx endpoint type */
#define USBDEV_ENDPTCTRL_TXT_MASK            (3 << USBDEV_ENDPTCTRL_TXT_SHIFT)
#define USBDEV_ENDPTCTRL_TXT_CTRL          (0 << USBDEV_ENDPTCTRL_TXT_SHIFT)	/* Control */
#define USBDEV_ENDPTCTRL_TXT_ISOC          (1 << USBDEV_ENDPTCTRL_TXT_SHIFT)	/* Isochronous */
#define USBDEV_ENDPTCTRL_TXT_BULK          (2 << USBDEV_ENDPTCTRL_TXT_SHIFT)	/* Bulk */
#define USBDEV_ENDPTCTRL_TXT_INTR          (3 << USBDEV_ENDPTCTRL_TXT_SHIFT)	/* Interrupt */
/* Bit 20: Reserved */
#define USBDEV_ENDPTCTRL_TXI                 (1 << 21)	/* Bit 21: Tx data toggle inhibit */
#define USBDEV_ENDPTCTRL_TXR                 (1 << 22)	/* Bit 22: Tx data toggle reset */
#define USBDEV_ENDPTCTRL_TXE                 (1 << 23)	/* Bit 23: Tx endpoint enable */
/* Bits 24-31: Reserved */

/************************************************************************************
 * Public Types
 ************************************************************************************/

/************************************************************************************
 * Public Data
 ************************************************************************************/

/************************************************************************************
 * Public Functions
 ************************************************************************************/
#endif							/* __ARCH_ARM_SRC_IMXRT_CHIP_IMXRT_USB_H */
